from os import system

__author__ = 'Борис Шаховский'

system('ChCp 1251')
system('Mode 800')

'''b1    aa  aa      aa  aa  aa      aa  aa      aa  aa  aa      aa  aa      aa  aa  aa
-  b2     |   |       |   |   |       |   |       |   |   |       |   |       |   |   |
-        ### ###     ### ### ###     ### ###     ### ### ###     ### ###     ### ### ###
-  b3    ### # #     # # ### # #     # # # #     # # # # # #     # # # #     # # # # # #
w1 b3 +==###-# #--+--# #=###-# #--+--# #-# #--+--# #-# #-# #--+--# #-# #--+--# #-# #-# #--+
w2 b3 |xx### # #  |  # #x### # #  |  # # # #  |  # # # # # #  |  # # # #  |  # # # # # #  |
w2    |xx### ###  |  ###x### ###  |  ### ###  |  ### ### ###  |  ### ###  |  ### ### ###  |
w2    |xxx|   |   |   |xxx|   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
w1    +===+---+---+---+===+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+
w3      C   D   E   F   G   A   B   C   D   E   F   G   A   B   C   D   E   F   G   A   B'''


class Клавиатура:
    __НОТ = 12
    __ОКТАВ = int(0x80 / __НОТ) + 1  # октавы 0...10, но 9 и 10 не помещаются на консоль
    __ВЫСОТА, __ШИРИНА_ОКТАВЫ = 18, 7 * 4 + 1  # 7 белых клавиш шириной 4 символа

    def __init__(self):
        self.отпустить_все_клавиши()
        self.обновить()

    def нажать_клавишу(self, нота):
        self.__Клавиши[int(нота / 12)][нота % 12] = True

    def отпустить_все_клавиши(self):
        self.__Клавиши = [[False for _ in range(self.__НОТ)] for _ in range(self.__ОКТАВ)]

    def обновить(self):
        system('Cls')
        for строка in range(self.__ВЫСОТА):
            self.__обновить(строка, 1, self.__ШИРИНА_ОКТАВЫ - 7, self.__ШИРИНА_ОКТАВЫ)
            for октава in range(2, 9):
                self.__обновить(строка, октава, 0, self.__ШИРИНА_ОКТАВЫ)
            self.__обновить(строка, 9, 0, 3)
            print()

    def __обновить(self, строка, октава, левый_столбец, правый_столбец):
        self.__сбросить()
        for нота in range(self.__НОТ):
            if self.__Клавиши[октава][нота]:
                if нота == 0:    self.__До1, self.__До2, self.__До3 = '=', 'x', 'До'
                elif нота == 1:  self.__До1_1, self.__До2_1, self.__До3_1 = 'До#', '|', 'x'
                elif нота == 2:  self.__Ре1, self.__Ре2, self.__Ре3 = '=', 'x', 'Ре'
                elif нота == 3:  self.__Ре1_1, self.__Ре2_1, self.__Ре3_1 = 'Ре#', '|', 'x'
                elif нота == 4:  self.__Ми1, self.__Ми2, self.__Ми3 = '=', 'x', 'Ми'
                elif нота == 5:  self.__Фа1, self.__Фа2, self.__Фа3 = '=', 'x', 'Фа'
                elif нота == 6:  self.__Фа1_1, self.__Фа2_1, self.__Фа3_1 = 'Фа#', '|', 'x'
                elif нота == 7:  self.__Соль1, self.__Соль2, self.__Соль3 = '=', 'x', 'Соль'
                elif нота == 8:  self.__Соль1_1, self.__Соль2_1, self.__Соль3_1 = 'Соль#', '|', 'x'
                elif нота == 9:  self.__Ля1, self.__Ля2, self.__Ля3 = '=', 'x', 'Ля'
                elif нота == 10: self.__Ля1_1, self.__Ля2_1, self.__Ля3_1 = 'Ля#', '|', 'x'
                elif нота == 11: self.__Си1, self.__Си2, self.__Си3 = '=', 'x', 'Си'
        клавиатура = [
            '   %s %s    %s %s %s   ' % (self.__До1_1, self.__Ре1_1, self.__Фа1_1, self.__Соль1_1, self.__Ля1_1),
            '    %c   %c       %c   %c   %c    ' % (
                self.__До2_1, self.__Ре2_1, self.__Фа2_1, self.__Соль2_1, self.__Ля2_1),
            '   ### ###     ### ### ###   ',
            '   #%c# #%c#     #%c# #%c# #%c#   ' % (
                self.__До3_1, self.__Ре3_1, self.__Фа3_1, self.__Соль3_1, self.__Ля3_1),
            '+%c%c#%c#%c#%c#%c%c+%c%c#%c#%c#%c#%c#%c#%c%c+' % (self.__До1, self.__До1, self.__До3_1, self.__Ре1,
                self.__Ре3_1, self.__Ми1, self.__Ми1, self.__Фа1, self.__Фа1, self.__Фа3_1, self.__Соль1,
                self.__Соль3_1, self.__Ля1, self.__Ля3_1, self.__Си1, self.__Си1),
            '|%c%c#%c#%c#%c#%c%c|%c%c#%c#%c#%c#%c#%c#%c%c|' % (self.__До2, self.__До2, self.__До3_1, self.__Ре2,
                self.__Ре3_1, self.__Ми2, self.__Ми2, self.__Фа2, self.__Фа2, self.__Фа3_1, self.__Соль2,
                self.__Соль3_1, self.__Ля2, self.__Ля3_1, self.__Си2, self.__Си2),
            '|%c%c###%c###%c%c|%c%c###%c###%c###%c%c|' % (self.__До2, self.__До2, self.__Ре2, self.__Ми2, self.__Ми2,
                self.__Фа2, self.__Фа2, self.__Соль2, self.__Ля2, self.__Си2, self.__Си2),
            '|%c%c%c|%c%c%c|%c%c%c|%c%c%c|%c%c%c|%c%c%c|%c%c%c|' % (self.__До2, self.__До2, self.__До2,
                self.__Ре2, self.__Ре2, self.__Ре2, self.__Ми2, self.__Ми2, self.__Ми2,
                self.__Фа2, self.__Фа2, self.__Фа2, self.__Соль2, self.__Соль2, self.__Соль2,
                self.__Ля2, self.__Ля2, self.__Ля2, self.__Си2, self.__Си2, self.__Си2),
            '+%c%c%c+%c%c%c+%c%c%c+%c%c%c+%c%c%c+%c%c%c+%c%c%c+' % (self.__До1, self.__До1, self.__До1,
                self.__Ре1, self.__Ре1, self.__Ре1, self.__Ми1, self.__Ми1, self.__Ми1,
                self.__Фа1, self.__Фа1, self.__Фа1, self.__Соль1, self.__Соль1, self.__Соль1,
                self.__Ля1, self.__Ля1, self.__Ля1, self.__Си1, self.__Си1, self.__Си1),
            ' %s  %s  %s  %s %s  %s  %s  ' % (self.__До3, self.__Ре3, self.__Ми3,
                                              self.__Фа3, self.__Соль3, self.__Ля3, self.__Си3)]
        print([клавиатура[0], клавиатура[1], клавиатура[2], клавиатура[3], клавиатура[3], клавиатура[3],
               клавиатура[4], клавиатура[5], клавиатура[5], клавиатура[5], клавиатура[6],
               клавиатура[7], клавиатура[7], клавиатура[7], клавиатура[7], клавиатура[7],
               клавиатура[8], клавиатура[9]][строка][левый_столбец:правый_столбец],end='')

    def __сбросить(self):
        self.__До1_1 = self.__Ре1_1 = self.__Фа1_1 = self.__Ля1_1 = '   '
        self.__Соль1_1 = '     '
        self.__До2_1 = self.__Ре2_1 = self.__Фа2_1 = self.__Соль2_1 = self.__Ля2_1 = ' '
        self.__До3_1 = self.__Ре3_1 = self.__Фа3_1 = self.__Соль3_1 = self.__Ля3_1 = ' '
        self.__До1 = self.__Ре1 = self.__Ми1 = self.__Фа1 = self.__Соль1 = self.__Ля1 = self.__Си1 = '-'
        self.__До2 = self.__Ре2 = self.__Ми2 = self.__Фа2 = self.__Соль2 = self.__Ля2 = self.__Си2 = ' '
        self.__До3 = self.__Ре3 = self.__Ми3 = self.__Фа3 = self.__Ля3 = self.__Си3 = '  '
        self.__Соль3 = '    '
